// 자바스크립트

// 자바스크립트는 서버나 웹에서 작동하는 프로그램을 만드는 등 웹의 모든 부분을 다룰 수 있는 프로그래밍 언어


// 자바스크립트의 활용

// 1. 웹 클라이언트 애플리케이션 개발

// 2. 웹 서버 애플리케이션 개발

// 3. 모바일 애플리케이션 개발

// 4. 데스크톱 애플리케이션 개발, 데이터베이스 관리 가능



// 자바스크립트 버전

// ECMAScript

// 2015년에 발표된 버전 = ECMAScript 2015 (ES6)

// 자바스크립트의 핵심 문법인 화살표 함수, 클래스, 모듈, 향상된 객체 리터럴, 프로미스, async/await 등 포함



//자바스크립트 주요 기능

// - 동적 언어: JavaScript는 코드가 실행되는 시점에 해석되는 동적 언어이다. 이는 코드를 수정하고 즉시 결과를 확인할 수 있음을 의미한다.

// - 객체 기반: JavaScript는 객체 기반의 프로그래밍 언어이다. 즉, 객체를 사용해 데이터와 함수를 묶을 수 있다.

// - 실행 환경: JavaScript는 웹 브라우저에서 실행되도록 설계되었지만, Node.js와 같은 플랫폼을 사용하면 서버 측 프로그래밍도 가능하다.

// 이벤트기반 : Javascript는 이벤트 기반 프로그래밍을 지원, 사용자의 행동(클릭, 키보드 입력, 마우스 이동 등) 에 따라 코드가 실행되는 방식이다.